In [566]:
# Cel zadania

In [567]:
#### Celem zadania było zrozumienie, oczyszczenie i przeanalizowanie dostarczonego zbioru danych.
#### Zbiorem roboczym jest "TitanicMess.tsv".

In [568]:
# 1) Import bibliotek

In [569]:
import pandas as pd
import statistics

In [570]:
#### Wczytanie roboczego zbioru danych.

In [571]:
tit = pd.read_csv('E:\SIWB\TitanicMess.tsv', sep = '\t')

In [572]:
#### Wyświetlenie zbioru za pomocą display'a w celu zapoznania się z zawartością pliku.

In [573]:
display(tit)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,ship
0,1,0,3,"Braund, Mr. Owen Harris",male,22,1,0,A/5 21171,"7,25",NaN,S,Titanic
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38,1,0,PC 17599,"71,2833",C85,C,Titanic
2,3,1,3,"Heikkinen, Miss. Laina",female,26,0,0,STON/O2. 3101282,"7,925",NaN,S,Titanic
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35,1,0,113803,"53,1",C123,S,Titanic
4,5,0,3,"Allen, Mr. William Henry",male,35,0,0,373450,"8,05",NaN,S,Titanic
...,...,...,...,...,...,...,...,...,...,...,...,...,...
887,888,1,1,"Graham, Miss. Margaret Edith",female,19,0,0,112053,30,B42,S,Titanic
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,"23,45",NaN,S,Titanic
889,890,1,1,"Behr, Mr. Karl Howell",male,26,0,0,111369,30,C148,C,Titanic
890,891,0,3,"Dooley, Mr. Patrick",male,32,0,0,370376,"7,75",NaN,Q,Titanic
891,1000,1,1,Mr. Frederick Maxfield Hoyt,male,38,1,0,19943,90,C93,S,Titanic

In [574]:
#### Wykorzystanie funkcji "head" oraz "tail" dla lepszej czytelności.

In [575]:
display(tit.head(5))

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,ship
0,1,0,3,"Braund, Mr. Owen Harris",male,22,1,0,A/5 21171,"7,25",NaN,S,Titanic
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38,1,0,PC 17599,"71,2833",C85,C,Titanic
2,3,1,3,"Heikkinen, Miss. Laina",female,26,0,0,STON/O2. 3101282,"7,925",NaN,S,Titanic
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35,1,0,113803,"53,1",C123,S,Titanic
4,5,0,3,"Allen, Mr. William Henry",male,35,0,0,373450,"8,05",NaN,S,Titanic

In [576]:
display(tit.tail(5))

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,ship
887,888,1,1,"Graham, Miss. Margaret Edith",female,19,0,0,112053,30,B42,S,Titanic
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,"23,45",NaN,S,Titanic
889,890,1,1,"Behr, Mr. Karl Howell",male,26,0,0,111369,30,C148,C,Titanic
890,891,0,3,"Dooley, Mr. Patrick",male,32,0,0,370376,"7,75",NaN,Q,Titanic
891,1000,1,1,Mr. Frederick Maxfield Hoyt,male,38,1,0,19943,90,C93,S,Titanic

In [577]:
#### Na pierwszy rzut oka widać, że w kolumnach "Age", "Cabin" występuje brak danych, a także jedna zmienna w kolumnie "ship".

In [578]:
#### Potwierdzamy, że w kolumnie "ship" jest wyłącznie jedna zmienna, która nie jest ważna w analizie zbioru.

In [579]:
print(tit['ship'].unique())

['Titanic']

In [580]:
#### Dla analizy zbioru nie są konieczne również kolumny "Name" oraz "Ticket".

In [581]:
#### Tworzymy zatem tabele pozbawioną powyższych kolumn.

In [582]:
tit = tit[['PassengerId', 'Survived', 'Pclass', 'Sex', 'Age', 'SibSp', 'Parch', 'Fare', 'Embarked']]

In [583]:
# Czyszczenie danych

In [584]:
#### Wyrzucamy wszystkie 'NA' w tabeli.

In [585]:
def drop_na(tita):

    tit = len(tita)
    tita = tita.dropna()
    print("NA dropped: {}".format(tit - len(tita)))
      
tita = drop_na(tit)

NA dropped: 175

In [586]:
#### Wyrzucamy wszystkie duplikaty w tabeli.

In [587]:
def drop_dupl(tita):
    
    duplicate = len(tita[tita['PassengerId'].duplicated()])
    if duplicate > 0:
        tita = tita.drop_duplicates(subset = 'PassengerId', keep="last")
        print ("Duplicates dropped: {}".format(duplicate))
        return tita
    else:
        return tita
    
tita = drop_dupl(tit)

Duplicates dropped: 4

In [588]:
#### Sprawdzamy czy zabieg się udał.

In [589]:
tita[tita.duplicated()]

Empty DataFrame
Columns: [PassengerId, Survived, Pclass, Sex, Age, SibSp, Parch, Fare, Embarked]
Index: []

In [590]:
#### Patrzymy jak aktualnie prezentuje się nasz zbiór danych.

In [591]:
tita.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 888 entries, 0 to 891
Data columns (total 9 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  888 non-null    int64
 1   Survived     888 non-null    int64
 2   Pclass       888 non-null    int64
 3   Sex          888 non-null    object
 4   Age          715 non-null    object
 5   SibSp        888 non-null    int64
 6   Parch        888 non-null    int64
 7   Fare         888 non-null    object
 8   Embarked     886 non-null    object
dtypes: int64(5), object(4)
memory usage: 69.4+ KB

In [592]:
#Widać niespójności w typach danych w kilku kolumnach. Sprawdzamy wartości unikalne dla każej z kolumn.

In [593]:
tita.PassengerId.unique()

array([   1,    2,    3,    4,    5,    6,    7,    8,    9,   10,   12,
         13,   15,   16,   17,   18,   19,   20,   21,   22,   23,   11,
         25,   26,   27,   28,   29,   30,   31,   32,   33,   34,   35,
         36,   37,   38,   39,   40,   41,   42,   43,   44,   45,   46,
         47,   48,   49,   50,   51,   52,   53,   54,   55,   56,   57,
         58,   59,   60,   61,   62,   63,   64,   65,   66,   67,   68,
         69,   70,   71,   72,   73,   74,   75,   76,   77,   78,   79,
         80,   81,   82,   83,   84,   85,   86,   87,   88,   89,   90,
         91,   92,   93,   94,   95,   96,   97,   98,   99,  100,  101,
        102,  103,  104,  105,  106,  107,  108,  109,  110,  111,  112,
        113,  114,  115,  116,  117,  118,  119,  120,  121,  122,  123,
        124,  125,  126,  127,  128,  129,  130,  131,  132,  133,  134,
        135,  136,  137,  138,  139,  140,  141,  142,  143,  144,  145,
        146,  147,  148,  149,  150,  151,  152,  153,  154,  155,  156,
        157,  158,  159,  160,  161,  162,  163,  164,  165,  166,  167,
        168,  169,  170,  171,  172,  173,  174,  175,  176,  177,  178,
        179,  180,  181,  182,  183,  184,  185,  186,  187,  188,  189,
        190,  191,  192,  193,  194,  195,  196,  197,  198,  199,  200,
        201,  202,  203,  204,  205,  206,  207,  208,  209,  210,  211,
        212,  213,  214,  215,  216,  217,  218,  219,  220,  221,  222,
        223,  224,  226,  227,  228,  229,  230,  231,  232,  233,  234,
        235,  236,  237,  238,  239,  240,  241,  242,  243,  244,  245,
        246,  247,  248,  249,  250,  251,  252,  253,  254,  255,  256,
        257,  258,  259,  260,  261,  262,  263,  264,  265,  266,  267,
        268,  269,  270,  271,  272,  273,  274,  275,  276,  277,  278,
        279,  280,  281,  282,  283,  284,  285,  286,  287,  288,  289,
        290,  291,  292,  293,  294,  295,  296,  297,  298,  299,  300,
        301,  302,  303,  304,  305,  306,  307,  308,  309,  310,  311,
        312,  313,  314,  315,  316,  317,  318,  319,  320,  321,  322,
        323,  324,  325,  326,  327,  328,  329,  330,  331,  332,  333,
        334,  335,  336,  337,  338,  339,  340,  341,  342,  343,  344,
        345,  346,  347,  348,  349,  350,  351,  352,  353,  354,  355,
        356,  357,  358,  359,  360,  361,  362,  363,  364,  365,  366,
        367,  368,  369,  370,  371,  372,  373,  374,  375,  376,  377,
        378,  379,  380,  381,  382,  383,  384,  385,  386,  387,  388,
        389,  390,  391,  392,  393,  394,  395,  396,  397,  398,  399,
        400,  401,  402,  403,  404,  405,  406,  407,  408,  409,  410,
        411,  412,  413,  414,  415,  416,  417,  418,  419,  420,  421,
        422,  423,  424,  425,  426,  427,  428,  429,  430,  431,  432,
        433,  434,  435,  436,  437,  438,  439,  440,  441,  442,  443,
        444,  445,  446,  447,  448,  449,  450,  451,  452,  453,  454,
        455,  456,  457,  458,  459,  460,  461,  462,  463,  464,  465,
        466,  467,  468,  469,  470,  471,  472,  473,  474,  475,  476,
        477,  478,  479,  480,  481,  482,  483,  484,  485,  486,  487,
        488,  489,  490,  491,  492,  493,  494,  495,  496,  497,  498,
        499,  500,  501,  502,  503,  504,  505,  506,  507,  508,  509,
        510,  511,  512,  513,  514,  515,  516,  517,  518,  519,  520,
        522,  523,  524,  525,  526,  527,  528,  529,  530,  531,  532,
        533,  534,  535,  536,  537,  538,  539,  540,  541,  542,  543,
        544,  545,  546,  547,  548,  549,  550,  551,  552,  553,  554,
        555,  556,  557,  558,  559,  560,  561,  562,  563,  564,  565,
        566,  567,  568,  569,  570,  571,  572,  573,  574,  575,  576,
        577,  578,  579,  580,  581,  582,  583,  584,  585,  586,  587,
        588,  589,  590,  591,  592,  593,  594,  595,  596,  597,  598,
        599,  600,  601,  602,  603,  604,  605,  606,  607,  608,  609,
        610,  611,  612,  613,  614,  615,  616,  617,  618,  619,  620,
        621,  622,  623,  624,  625,  626,  627,  628,  629,  630,  631,
        632,  633,  634,  635,  636,  637,  638,  639,  640,  641,  642,
        643,  644,  645,  646,  647,  648,  649,  650,  651,  652,  653,
        654,  655,  656,  657,  658,  659,  660,  661,  662,  663,  664,
        665,  666,  667,  668,  669,  670,  671,  672,  673,  674,  675,
        676,  677,  678,  225,  680,  681,  682,  683,  684,  685,  686,
        687,  688,  689,  690,  691,  692,  693,  694,  695,  696,  697,
        698,  699,  700,  701,  702,  703,  704,  705,  706,  707,  708,
        709,  710,  711,  712,  713,  714,  715,  716,  717,  718,  719,
        720,  721,  722,  723,  724,  725,  726,  727,  728,  729,  730,
        731,  732,  733,  734,  735,  736,  737,  738,  739,  740,  741,
        742,  743,  744,  745,  746,  747,  748,  749,  750,  751,  752,
        753,  754,  755,  756,  757,  758,  759,  760,  761,  762,  763,
        764,  765,  766,  767,  768,  769,  770,  771,  772,  773,  774,
        775,  776,  777,  778,  779,  780,  781,  782,  783,  784,  785,
        786,  787,  788,  789,  790,  791,  792,  793,  794,  795,  796,
        797,  798,  799,  800,  801,  802,  803,  804,  805,  806,  807,
        808,  809,  810,  811,  812,  813,  814,  815,  816,  817,  818,
        819,  820,  821,  822,  823,  824,  825,  826,  827,  828,  829,
        830,  831,  832,  833,  834,  835,  836,  837,  838,  839,  840,
        841,  842,  843,  844,  845,  846,  847,  848,  849,  850,  851,
        852,  853,  854,  855,  856,  857,  858,  859,  860,  861,  862,
        863,  864,  865,  866,  867,  868,  869,  870,  871,  872,  873,
        874,  875,  876,  877,  878,  879,  880,  881,  882,  883,  884,
        885,  886,  887,  888,  889,  890,  891, 1000], dtype=int64)

In [594]:
tita.Survived.unique()

array([0, 1], dtype=int64)

In [595]:
tita.Pclass.unique()

array([3, 1, 2], dtype=int64)

In [596]:
tita.Sex.unique()

array(['male', 'female', 'malef', 'mal', 'fem', 'femmale'], dtype=object)

In [597]:
##### Kolumna "Sex" wymaga manualnej korekcji, ponieważ występują w niej literówki.

In [598]:
tita = tita.copy()
tita['Sex'] = tita['Sex'].replace({'malef': 'male', 'mal': 'male', 'femmale': 'female','fem' : 'female'})

In [599]:
print(tita['Sex'].unique())

['male' 'female']

In [600]:
#### Udało się naprawić kolumne "Sex".

In [601]:
tita.SibSp.unique()

array([1, 0, 3, 4, 2, 5, 8], dtype=int64)

In [602]:
tita.Parch.unique()

array([0, 1, 2, 5, 3, 4], dtype=int64)

In [603]:
tita.Fare.unique()

array(['7,25', '71,2833', '7,925', '53,1', '8,05', '8,4583', '51,8625',
       '21,075', '11,1333', '30,0708', '26,55', '7,8542', '16', '29,125',
       '13', '18', '7,225', '26', '8,0292', '16,7', '31,3875', '263',
       '7,8792', '7,8958', '27,7208', '146,5208', '7,75', '10,5',
       '82,1708', '52', '7,2292', '11,2417', '9,475', '21', '41,5792',
       '15,5', '21,6792', '17,8', '39,6875', '7,8', '76,7292', '61,9792',
       '35,5', '27,75', '46,9', '80', '83,475', '27,9', '15,2458',
       '8,1583', '8,6625', '73,5', '14,4542', '56,4958', '7,65', '29',
       '12,475', '9', '9,5', '7,7875', '47,1', '15,85', '34,375',
       '61,175', '20,575', '34,6542', '63,3583', '23', '77,2875',
       '8,6542', '7,775', '24,15', '9,825', '14,4583', '247,5208',
       '31,275', '7,1417', '22,3583', '6,975', '7,05', '14,5', '15,0458',
       '26,2833', '9,2167', '79,2', '6,75', '11,5', '36,75', '7,7958',
       '12,525', '66,6', '7,3125', '61,3792', '7,7333', '69,55', '16,1',
       '15,75', '20,525', '55', '25,925', '33,5', '30,6958', '25,4667',
       '28,7125', '0', '15,05', '39', '22,025', '50', '8,4042', '6,4958',
       '10,4625', '18,7875', '31', '113,275', '27', '76,2917', '9,35',
       '13,5', '7,55', '26,25', '12,275', '7,125', '-90', '52,5542',
       '20,2125', '86,5', '512,3292', '79,65', '153,4625', '135,6333',
       '19,5', '29,7', '77,9583', '20,25', '78,85', '91,0792', '12,875',
       '8,85', '151,55', '30,5', '23,25', '12,35', '110,8833', '108,9',
       '24', '56,9292', '83,1583', '262,375', '14', '164,8667', '134,5',
       '6,2375', '57,9792', '28,5', '133,65', '15,9', '9,225', '35',
       '75,25', '69,3', '55,4417', '211,5', '4,0125', '227,525',
       '15,7417', '7,7292', '12', '120', '12,65', '18,75', '6,8583', '90',
       '32,5', '7,875', '14,4', '55,9', '8,1125', '81,8583', '19,2583',
       '19,9667', '89,1042', '38,5', '7,725', '13,7917', '9,8375',
       '7,0458', '7,5208', '12,2875', '9,5875', '15,9a', '49,5042',
       '78,2667', '15,1', '7,6292', '22,525', '26,2875', '59,4', '7,4958',
       '34,0208', '221,7792', '106,425', '49,5', '71', '13,8625',
       '7,8292', '39,6', '17,4', '51,4792', '26,3875', '30', '40,125',
       '8,7125', '15', '33', '42,4', '15,55', '65', '32,3208', '7,0542',
       '8,4333', '25,5875', '9,8417', '8,1375', '10,1708', '211,3375',
       '57', '13,4167', '7,7417', '9,4833', '7,7375', '8,3625', '23,45',
       '25,9292', '8,6833', '8,5167', '7,8875', '37,0042', '6,45', '93,5',
       '6,95', '8,3', '6,4375', '39,4', '14,1083', '13,8583', '50,4958',
       '5', '9,8458', '10,5167'], dtype=object)

In [604]:
#### Podobny problem jak w kolumnie "Sex" w kolumnie "Embarked". Wymaga manualnej korekcji.

In [605]:
tita.Embarked.unique()

array(['S', 'C', 'Q', 'So', nan, 'Co', 'Qe'], dtype=object)

In [606]:
tita = tita.copy()
tita['Embarked'] = tita['Embarked'].replace({'So':'S', 'Qe':'Q', 'Co':'C', 'nan':'NaN'})

In [607]:
tita.Embarked.unique()

array(['S', 'C', 'Q', nan], dtype=object)

In [608]:
#### Udało się częściowo poprawić kolumne, pozostał jeszcze 'nan', który można usunąć za pomocą "pandas dropna by inplace"

In [609]:
tita.dropna(inplace=True)

In [610]:
tita.Embarked.unique()

array(['S', 'C', 'Q'], dtype=object)

In [611]:
#### Udało się, mamy właściwie poprawioną kolumnę.

In [612]:
tita.Survived.unique()

array([0, 1], dtype=int64)

In [613]:
tita.Age.unique()

array(['22', '38', '26', '35', '54', '2', '27', '14', '58', '20', '55',
       '31', '34', '15', '4', '8', '19', '40', '.9', '66', '28', '42',
       '21', '18', '3', '7', '49', '29', '65', '28,5', '5', '11', '45',
       '17', '32', '16', '25', '0,83', '30', '33', '23', '24', '46', '59',
       '71', '37', '47', '14,5', '70,5', '32,5', '12', '9', '36,5', '51',
       '55,5', '40,5', '44', '1', '61', '56', '50', '36', '45,5', '4435',
       '20,5', '62', '41', '52', '63', '23,5', '0,92', '43', '60', '39',
       '10', '64', '13', '48', '0,75', '-3', '-12', '53', '57', '80',
       '250', '70', '24,5', '6', '0,67', '30,5', '0,42', '34,5', '74'],
      dtype=object)

In [614]:
#### Podczas monitorowania kolumny "Age" widać niespójności w danych: 
#### 1) Występują wartości nieralne (4435, 250)
#### 2) Oraz wiek jest podany w wartościach dziesiętnych i ujemnych

In [615]:
tAge = tita['Age'].value_counts().to_dict()

In [616]:
display(tAge)

{'24': 30,
 '22': 27,
 '18': 26,
 '19': 25,
 '28': 24,
 '30': 24,
 '21': 24,
 '25': 22,
 '36': 22,
 '29': 20,
 '27': 18,
 '26': 18,
 '32': 18,
 '35': 18,
 '16': 17,
 '31': 17,
 '34': 15,
 '23': 15,
 '20': 15,
 '33': 15,
 '39': 13,
 '42': 13,
 '40': 13,
 '17': 13,
 '45': 12,
 '38': 11,
 '2': 10,
 '4': 10,
 '50': 10,
 '44': 9,
 '48': 9,
 '47': 9,
 '54': 8,
 '9': 8,
 '1': 7,
 '51': 7,
 '41': 6,
 '52': 6,
 '37': 6,
 '49': 6,
 '3': 6,
 '14': 6,
 '15': 5,
 '58': 5,
 '43': 4,
 '60': 4,
 '8': 4,
 '56': 4,
 '5': 4,
 '11': 4,
 '6': 3,
 '46': 3,
 '65': 3,
 '7': 3,
 '62': 3,
 '61': 3,
 '70': 2,
 '64': 2,
 '0,83': 2,
 '55': 2,
 '59': 2,
 '0,75': 2,
 '28,5': 2,
 '57': 2,
 '63': 2,
 '40,5': 2,
 '10': 2,
 '32,5': 2,
 '13': 2,
 '45,5': 2,
 '71': 2,
 '30,5': 2,
 '0,92': 1,
 '250': 1,
 '0,42': 1,
 '53': 1,
 '0,67': 1,
 '.9': 1,
 '66': 1,
 '4435': 1,
 '23,5': 1,
 '20,5': 1,
 '70,5': 1,
 '24,5': 1,
 '14,5': 1,
 '-3': 1,
 '80': 1,
 '74': 1,
 '12': 1,
 '34,5': 1,
 '55,5': 1,
 '36,5': 1,
 '-12': 1}

In [617]:
tita = tita[tita.Age.apply(lambda x: x.isnumeric())]

In [618]:
tita = tita.astype({'Age': int, 'Survived': bool})

In [619]:
print(tita[tita['Age'] > 100])
tita = tita[tita['Age'] < 100]

     PassengerId  Survived  Pclass   Sex   Age  SibSp  Parch    Fare Embarked
223          224     False       3  male  4435      0      0  7,8958        S
666          667     False       2  male   250      0      0      13        S

In [620]:
print('min_age :', tita['Age'].min(),' <<--->> ',tita['Age'].max(),": max_age")

min_age : 1  <<--->>  80 : max_age

In [621]:
#### Sprawdzamy poraz kolejny jak wyglada kolumna.

In [622]:
tita

,PassengerId,Survived,Pclass,Sex,Age,SibSp,Parch,Fare,Embarked
0,1,False,3,male,22,1,0,"7,25",S
1,2,True,1,female,38,1,0,"71,2833",C
2,3,True,3,female,26,0,0,"7,925",S
3,4,True,1,female,35,1,0,"53,1",S
4,5,False,3,male,35,0,0,"8,05",S
...,...,...,...,...,...,...,...,...,...
886,887,False,2,male,27,0,0,13,S
887,888,True,1,female,19,0,0,30,S
889,890,True,1,male,26,0,0,30,C
890,891,False,3,male,32,0,0,"7,75",Q
891,1000,True,1,male,38,1,0,90,S

In [623]:
#### Sprawdzamy ponownie wartości unikalne zbioru.

In [624]:
def finalTest(test):
    
    try:
        print(10*">" + ' ' + test + ' ' +10*"<")
        print(45*'-')
        print('')
    except:
        print('Error')
        
def valueCounts(tita):
    
    num_of_cols = len(tita.columns)
    
    for i, j in enumerate(tita.columns):
        print('')
        print('')
        print(10*'*',j,10*'*')
        finalTest("Test --> {}".format(j))
        print(tita[j].value_counts())

In [625]:
valueCounts(tita)

********** PassengerId **********
>>>>>>>>>> Test --> PassengerId <<<<<<<<<<
---------------------------------------------

1000    1
295     1
312     1
311     1
310     1
       ..
600     1
598     1
596     1
595     1
1       1
Name: PassengerId, Length: 683, dtype: int64


********** Survived **********
>>>>>>>>>> Test --> Survived <<<<<<<<<<
---------------------------------------------

False    404
True     279
Name: Survived, dtype: int64


********** Pclass **********
>>>>>>>>>> Test --> Pclass <<<<<<<<<<
---------------------------------------------

3    336
1    181
2    166
Name: Pclass, dtype: int64


********** Sex **********
>>>>>>>>>> Test --> Sex <<<<<<<<<<
---------------------------------------------

male      431
female    252
Name: Sex, dtype: int64


********** Age **********
>>>>>>>>>> Test --> Age <<<<<<<<<<
---------------------------------------------

24    30
22    27
18    26
19    25
30    24
      ..
74     1
66     1
12     1
53     1
80     1
Name: Age, Length: 70, dtype: int64


********** SibSp **********
>>>>>>>>>> Test --> SibSp <<<<<<<<<<
---------------------------------------------

0    448
1    177
2     23
4     18
3     12
5      5
Name: SibSp, dtype: int64


********** Parch **********
>>>>>>>>>> Test --> Parch <<<<<<<<<<
---------------------------------------------

0    501
1    105
2     64
3      5
5      4
4      4
Name: Parch, dtype: int64


********** Fare **********
>>>>>>>>>> Test --> Fare <<<<<<<<<<
---------------------------------------------

13         39
26         29
8,05       26
10,5       24
7,8958     23
           ..
15          1
12,275      1
61,3792     1
13,4167     1
8,6542      1
Name: Fare, Length: 218, dtype: int64


********** Embarked **********
>>>>>>>>>> Test --> Embarked <<<<<<<<<<
---------------------------------------------

S    537
C    121
Q     25
Name: Embarked, dtype: int64

In [626]:
#### Wydaje się, że plik został oczyszczony właściwie.

In [627]:
#### Na koniec zapisujemy finalny plik do "TitanicCleaned.tsv"

In [628]:
tita.to_csv('TitanicCleaned.tsv', index = False)

In [629]:
# Wnioski

In [630]:
#### Roboczy zestaw danych wymagał kilku istotnych zabiegów by doprowadzić go do właściwej formy. Należało usunąć wiersze z brakującymi danycmi, usunąć duplikaty, zmienić typy danych w konkretnych kolumnach a także usunięcia kolumn nieistotnych w analizie.